# Aula 2 - Data Science

Nome: Matheus de Souza Moura

Turma: TADS-034

In [ ]:
url = "https://drive.google.com/uc?id=1Jgto7psHaMRTAVzcFt7D6SgJiHMB7uGT"

In [ ]:
import pandas as pd
import csv as csv

df = pd.read_csv(url)

ModuleNotFoundError: No module named 'pandas'

In [ ]:
df

    ID_Escola Nome_Escola Tipo_Escola  Numero_Alunos  Orcamento_Anual
0           0    Escola A     Publica           2917          1910635
1           1    Escola B     Publica           2949          1884411
2           2    Escola C  Particular           1761          1056600
3           3    Escola D     Publica           4635          3022020
4           4    Escola E  Particular           1468           917500
5           5    Escola F  Particular           2283          1319574
6           6    Escola G  Particular           1858          1081356
7           7    Escola H     Publica           4976          3124928
8           8    Escola I  Particular            427           248087
9           9    Escola J  Particular            962           585858
10         10    Escola K  Particular           1800          1049400
11         11    Escola L     Publica           3999          2547363
12         12    Escola M     Publica           4761          3094650
13         13    Escola N     Publica           2739          1763916
14         14    Escola O  Particular           1635          1043130

<h2>Qual o orçamento total de todas as escolas?</h2>
<p><b>Dica:</b> Use a função sum() para calcular o total da coluna Orcamento_Anual.</p>

In [ ]:
df['Orcamento_Anual'].sum()

np.int64(24649428)

<h2>Qual escola tem o maior e menor gasto per capita (Gasto por aluno)?</h2>
<p><b>Dica:</b> Crie uma nova coluna para calcular o gasto per capita, dividindo
Orcamento_Anual pelo Numero_Alunos, e use as funções idxmax() e
idxmin() para identificar as escolas com o maior e menor valor.</p>

<p>Criando a coluna.</p>

In [ ]:
df['Gastos'] = df['Orcamento_Anual'] / df['Numero_Alunos']
df

    ID_Escola Nome_Escola Tipo_Escola  Numero_Alunos  Orcamento_Anual  Gastos
0           0    Escola A     Publica           2917          1910635   655.0
1           1    Escola B     Publica           2949          1884411   639.0
2           2    Escola C  Particular           1761          1056600   600.0
3           3    Escola D     Publica           4635          3022020   652.0
4           4    Escola E  Particular           1468           917500   625.0
5           5    Escola F  Particular           2283          1319574   578.0
6           6    Escola G  Particular           1858          1081356   582.0
7           7    Escola H     Publica           4976          3124928   628.0
8           8    Escola I  Particular            427           248087   581.0
9           9    Escola J  Particular            962           585858   609.0
10         10    Escola K  Particular           1800          1049400   583.0
11         11    Escola L     Publica           3999          2547363   637.0
12         12    Escola M     Publica           4761          3094650   650.0
13         13    Escola N     Publica           2739          1763916   644.0
14         14    Escola O  Particular           1635          1043130   638.0

<p>Escola com maior gasto.</p>

In [ ]:
#Apenas mostrando o índice:
max_gasto = df['Gastos'].idxmax()
print(f"O índice da escola com maior gasto é: {max_gasto}\n")

#Mostrando o índice e outros informações:
info_max = df.loc[max_gasto]
print(info_max)

O índice da escola com maior gasto é: 0

ID_Escola                 0
Nome_Escola        Escola A
Tipo_Escola         Publica
Numero_Alunos          2917
Orcamento_Anual     1910635
Gastos                655.0
Name: 0, dtype: object

<p>Escola com menor gasto.</p>

In [ ]:
#Apenas mostrando o índice:
min_gasto = df['Gastos'].idxmin()
print(f"O índice da escola com menor gasto é: {min_gasto}\n")

#Mostrando o índice e outros informações:
info_min = df.loc[min_gasto]
print(info_min)

O índice da escola com menor gasto é: 5

ID_Escola                   5
Nome_Escola          Escola F
Tipo_Escola        Particular
Numero_Alunos            2283
Orcamento_Anual       1319574
Gastos                  578.0
Name: 5, dtype: object

<h2>Qual é a média do número de alunos por tipo de escola (Pública vs. Particular)?</h2>
<p><b>Dica:</b> Use a função groupby() combinada com mean() para calcular a média
do número de alunos agrupada por tipo de escola (Tipo_Escola).</p>

In [ ]:
media_escolas = df.groupby('Tipo_Escola')[['Numero_Alunos']].mean()
print(media_escolas)

             Numero_Alunos
Tipo_Escola
Particular     1524.250000
Publica        3853.714286

<h2>Quantas escolas têm um orçamento anual acima de 1,5 milhão?</h2>
<p><b>Dica:</b> Use a função sum() para contar quantas escolas têm
Orcamento_Anual maior que 1.5 milhão.</p>

In [ ]:
quantidade = (df['Orcamento_Anual'] > 1500000).sum()
print(f"A quantidade de escolas que possuem um Orcamento Anual maior que 1,5 Milhão são: {quantidade}")

A quantidade de escolas que possuem um Orcamento Anual maior que 1,5 Milhão são: 7